zmzdh/CAN_st_test/Drivers/Drivers/FM33FG0xxA_FL_Driver/Inc/fm33fg0xxa_fl_lpuart.h
#define    LPUART_CSR_TXEN_Pos                                    (0U)
#define    LPUART_CSR_TXEN_Msk                                    (0x1U << LPUART_CSR_TXEN_Pos)
#define    LPUART_CSR_TXEN                                        LPUART_CSR_TXEN_Msk

#define    LPUART_IER_RXEV_IE_Pos                                 (12U)
#define    LPUART_IER_RXEV_IE_Msk                                 (0x1U << LPUART_IER_RXEV_IE_Pos)
#define    LPUART_IER_RXEV_IE                                     LPUART_IER_RXEV_IE_Msk

#define    LPUART_IER_RXERR_IE_Pos                                (10U)
#define    LPUART_IER_RXERR_IE_Msk                                (0x1U << LPUART_IER_RXERR_IE_Pos)
#define    LPUART_IER_RXERR_IE                                    LPUART_IER_RXERR_IE_Msk

#define    LPUART_IER_RXBF_IE_Pos                                 (8U)
#define    LPUART_IER_RXBF_IE_Msk                                 (0x1U << LPUART_IER_RXBF_IE_Pos)
#define    LPUART_IER_RXBF_IE                                     LPUART_IER_RXBF_IE_Msk

#define    LPUART_IER_TXBE_IE_Pos                                 (1U)
#define    LPUART_IER_TXBE_IE_Msk                                 (0x1U << LPUART_IER_TXBE_IE_Pos)
#define    LPUART_IER_TXBE_IE                                     LPUART_IER_TXBE_IE_Msk

#define    LPUART_IER_TXSE_IE_Pos                                 (0U)
#define    LPUART_IER_TXSE_IE_Msk                                 (0x1U << LPUART_IER_TXSE_IE_Pos)
#define    LPUART_IER_TXSE_IE                                     LPUART_IER_TXSE_IE_Msk

#define    LPUART_ISR_RXEVF_Pos                                   (24U)
#define    LPUART_ISR_RXEVF_Msk                                   (0x1U << LPUART_ISR_RXEVF_Pos)
#define    LPUART_ISR_RXEVF                                       LPUART_ISR_RXEVF_Msk

#define    LPUART_ISR_TXOV_Pos                                    (19U)
#define    LPUART_ISR_TXOV_Msk                                    (0x1U << LPUART_ISR_TXOV_Pos)
#define    LPUART_ISR_TXOV                                        LPUART_ISR_TXOV_Msk

#define    LPUART_ISR_PERR_Pos                                    (18U)
#define    LPUART_ISR_PERR_Msk                                    (0x1U << LPUART_ISR_PERR_Pos)
#define    LPUART_ISR_PERR                                        LPUART_ISR_PERR_Msk

#define    LPUART_ISR_FERR_Pos                                    (17U)
#define    LPUART_ISR_FERR_Msk                                    (0x1U << LPUART_ISR_FERR_Pos)
#define    LPUART_ISR_FERR                                        LPUART_ISR_FERR_Msk

#define    LPUART_ISR_OERR_Pos                                    (16U)
#define    LPUART_ISR_OERR_Msk                                    (0x1U << LPUART_ISR_OERR_Pos)
#define    LPUART_ISR_OERR                                        LPUART_ISR_OERR_Msk

#define    LPUART_ISR_RXBF_Pos                                    (8U)
#define    LPUART_ISR_RXBF_Msk                                    (0x1U << LPUART_ISR_RXBF_Pos)
#define    LPUART_ISR_RXBF                                        LPUART_ISR_RXBF_Msk

#define    LPUART_ISR_TXBE_Pos                                    (1U)
#define    LPUART_ISR_TXBE_Msk                                    (0x1U << LPUART_ISR_TXBE_Pos)
#define    LPUART_ISR_TXBE                                        LPUART_ISR_TXBE_Msk

#define    LPUART_ISR_TXSE_Pos                                    (0U)
#define    LPUART_ISR_TXSE_Msk                                    (0x1U << LPUART_ISR_TXSE_Pos)
#define    LPUART_ISR_TXSE                                        LPUART_ISR_TXSE_Msk

#define    LPUART_BMR_MCTL_EN_Pos                                 (31U)
#define    LPUART_BMR_MCTL_EN_Msk                                 (0x1U << LPUART_BMR_MCTL_EN_Pos)
#define    LPUART_BMR_MCTL_EN                                     LPUART_BMR_MCTL_EN_Msk

#define    LPUART_BMR_MCTL_Pos                                    (16U)
#define    LPUART_BMR_MCTL_Msk                                    (0xfffU << LPUART_BMR_MCTL_Pos)
#define    LPUART_BMR_MCTL                                        LPUART_BMR_MCTL_Msk

#define    LPUART_BMR_BAUD_Pos                                    (0U)
#define    LPUART_BMR_BAUD_Msk                                    (0x7U << LPUART_BMR_BAUD_Pos)
#define    LPUART_BMR_BAUD                                        LPUART_BMR_BAUD_Msk






#define    FL_LPUART_WAKEUP_NO_CHECK                              (0x0U << LPUART_CSR_WKBYTE_CFG_Pos)
#define    FL_LPUART_WAKEUP_CHECK                                 (0x1U << LPUART_CSR_WKBYTE_CFG_Pos)


#define    FL_LPUART_WAKEUP_EVENT_START                           (0x0U << LPUART_CSR_RXEV_Pos)
#define    FL_LPUART_WAKEUP_EVENT_RECV_1BYTE                      (0x1U << LPUART_CSR_RXEV_Pos)
#define    FL_LPUART_WAKEUP_EVENT_RECV_MATCH                      (0x2U << LPUART_CSR_RXEV_Pos)
#define    FL_LPUART_WAKEUP_EVENT_RX_FALLING                      (0x3U << LPUART_CSR_RXEV_Pos)


#define    FL_LPUART_BIT_ORDER_LSB_FIRST                          (0x0U << LPUART_CSR_BITORD_Pos)
#define    FL_LPUART_BIT_ORDER_MSB_FIRST                          (0x1U << LPUART_CSR_BITORD_Pos)


#define    FL_LPUART_STOP_BIT_WIDTH_1B                            (0x0U << LPUART_CSR_STOPCFG_Pos)
#define    FL_LPUART_STOP_BIT_WIDTH_2B                            (0x1U << LPUART_CSR_STOPCFG_Pos)


#define    FL_LPUART_DATA_WIDTH_7B                                (0x0U << LPUART_CSR_PDSEL_Pos)
#define    FL_LPUART_DATA_WIDTH_8B                                (0x1U << LPUART_CSR_PDSEL_Pos)
#define    FL_LPUART_DATA_WIDTH_9B                                (0x2U << LPUART_CSR_PDSEL_Pos)
#define    FL_LPUART_DATA_WIDTH_6B                                (0x3U << LPUART_CSR_PDSEL_Pos)


#define    FL_LPUART_PARITY_NONE                                  (0x0U << LPUART_CSR_PARITY_Pos)
#define    FL_LPUART_PARITY_EVEN                                  (0x1U << LPUART_CSR_PARITY_Pos)
#define    FL_LPUART_PARITY_ODD                                   (0x2U << LPUART_CSR_PARITY_Pos)


